["Paragraph:Linking of terms and files happens in edit mode. When a term has been created you can link and unlink terms and files to the term. For unsaved term the linking of files is only supported for now.", "Title:Link", "Paragraph:To link terms you press the \"Link terms\" -button or \"Alt+L\". A dialog showing all linkable terms pops up #img(\"linking-terms.png\",\"Link terms dialog.\"). From this dialog you can choose multiple terms for linking. If the \"Ok\" is pressed from dialog the selected terms are linked to current term. If \"Cancel\" is pressed, no linking happens. After the linking newly linked terms will emerge at \"Linked terms and files\" -view.", "Paragraph:To add files to term you press \"Link files\" or \"Alt+k\". Standard open file dialog pops up and user can choose multiple files from a folder. When\n\"Open\" is clicked or a file is double clicked the selected file(s) are linked to the term. The files emerge at \"Linked terms and files\" view. If some of the files where images, they are automatically recognised and show in different color than files and terms #img(\"linked-terms-and-files.png\",\"Terms, files and images.\").", "Title:Adding image to description", "Paragraph:By double clicking on an image in \"Linked terms and files\" view an image tag is inserted to the description of the term at the current location of the carret in the text. In view mode the title part of the tag (#img(\"/path/to/image\",\"Title\")) is shown as a text in place of the tag like this: \"Image: Title\". The Image is added below the paragraph in which it was first tagged. It is also possible to write the tag by hand, in which case the image is added to term when editing session ends.", "Title:Unlink", "Paragraph:Unlinking #img(\"unlinkable-files.png\",\"Unlink dialog\") happens the same way for terms and files. When user presses \"Unlink terms\"/\"Alt+U\" or \"Unlink files\"/\"Ctrl+U\" a dialog pop's up showing\nall the terms/files that can be removed from the term. User can choose multiple items from the list and if \"Ok\" is pressed the terms/files will be removed from the term."]